cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1231H6PGE.svd.xml
        <register>
          <name>ICR</name>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TIMER_ICR_TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAMCINT</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAECINT</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_RTCCINT</name>
              <description>GPTM RTC Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TAMCINT</name>
              <description>GPTM Timer A Match Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBMCINT</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBECINT</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBMCINT</name>
              <description>GPTM Timer B Match Interrupt Clear</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_WUECINT</name>
              <description>32/64-Bit GPTM Write Update Error Interrupt Clear</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAILR</name>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
        </register>
        <register>
          <name>TBILR</name>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
        </register>
        <register>
          <name>TAMATCHR</name>
          <description>GPTM Timer A Match</description>
          <addressOffset>0x00000030</addressOffset>
        </register>
        <register>
          <name>TBMATCHR</name>
          <description>GPTM Timer B Match</description>
          <addressOffset>0x00000034</addressOffset>
        </register>
        <register>
          <name>TAPR</name>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPR_TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAPR_TAPSRH</name>
              <description>GPTM Timer A Prescale High Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPR_TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TBPR_TBPSRH</name>
              <description>GPTM Timer B Prescale High Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPMR</name>
          <description>GPTM TimerA Prescale Match</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPMR_TAPSMR</name>
              <description>GPTM TimerA Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAPMR_TAPSMRH</name>
              <description>GPTM Timer A Prescale Match High Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPMR</name>
          <description>GPTM TimerB Prescale Match</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPMR_TBPSMR</name>
              <description>GPTM TimerB Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TBPMR_TBPSMRH</name>
              <description>GPTM Timer B Prescale Match High Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
        </register>
        <register>
          <name>TBR</name>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
        </register>
        <register>
          <name>TAV</name>
          <description>GPTM Timer A Value</description>
          <addressOffset>0x00000050</addressOffset>
        </register>
        <register>
          <name>TBV</name>
          <description>GPTM Timer B Value</description>
          <addressOffset>0x00000054</addressOffset>
        </register>
        <register>
          <name>RTCPD</name>
          <description>GPTM RTC Predivide</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>TIMER_RTCPD_RTCPD</name>
              <description>RTC Predivide Counter Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPS</name>
          <description>GPTM Timer A Prescale Snapshot</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPS_PSS</name>
              <description>GPTM Timer A Prescaler Snapshot</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPS</name>
          <description>GPTM Timer B Prescale Snapshot</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPS_PSS</name>
              <description>GPTM Timer A Prescaler Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPV</name>
          <description>GPTM Timer A Prescale Value</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPV_PSV</name>
              <description>GPTM Timer A Prescaler Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPV</name>
          <description>GPTM Timer B Prescale Value</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPV_PSV</name>
              <description>GPTM Timer B Prescaler Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>GPTM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>TIMER_PP_SIZE</name>
              <description>Count Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_16</name>
                  <description>Timer A and Timer B counters are 16 bits each with an 8-bit prescale counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_32</name>
                  <description>Timer A and Timer B counters are 32 bits each with a 16-bit prescale counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
