cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1231H6PGE.svd.xml
        <register>
          <name>SCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000718</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCUART_S0</name>
              <description>UART Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S1</name>
              <description>UART Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S2</name>
              <description>UART Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S3</name>
              <description>UART Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S4</name>
              <description>UART Module 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S5</name>
              <description>UART Module 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S6</name>
              <description>UART Module 6 Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S7</name>
              <description>UART Module 7 Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCSSI</name>
          <description>Synchronous Serial Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000071C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCSSI_S0</name>
              <description>SSI Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S1</name>
              <description>SSI Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S2</name>
              <description>SSI Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S3</name>
              <description>SSI Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCI2C</name>
          <description>Inter-Integrated Circuit Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000720</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCI2C_S0</name>
              <description>I2C Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S1</name>
              <description>I2C Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S2</name>
              <description>I2C Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S3</name>
              <description>I2C Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S4</name>
              <description>I2C Module 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S5</name>
              <description>I2C Module 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCCAN</name>
          <description>Controller Area Network Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000734</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCCAN_S0</name>
              <description>CAN Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCADC</name>
          <description>Analog-to-Digital Converter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000738</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCADC_S0</name>
              <description>ADC Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCADC_S1</name>
              <description>ADC Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCACMP</name>
          <description>Analog Comparator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000073C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCACMP_S0</name>
              <description>Analog Comparator Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCEEPROM</name>
          <description>EEPROM Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000758</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCEEPROM_S0</name>
              <description>EEPROM Module Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWTIMER</name>
          <description>Wide Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000075C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCWTIMER_S0</name>
              <description>Wide Timer 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S1</name>
              <description>Wide Timer 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S2</name>
              <description>Wide Timer 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S3</name>
              <description>Wide Timer 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S4</name>
              <description>Wide Timer 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S5</name>
              <description>Wide Timer 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWD</name>
          <description>Watchdog Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCWD_D0</name>
              <description>Watchdog Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWD_D1</name>
              <description>Watchdog Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCTIMER</name>
          <description>Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCTIMER_D0</name>
              <description>Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D1</name>
              <description>Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D2</name>
              <description>Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D3</name>
              <description>Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D4</name>
              <description>Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D5</name>
              <description>Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCGPIO</name>
          <description>General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCGPIO_D0</name>
              <description>GPIO Port A Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D1</name>
              <description>GPIO Port B Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D2</name>
              <description>GPIO Port C Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D3</name>
              <description>GPIO Port D Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D4</name>
              <description>GPIO Port E Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D5</name>
              <description>GPIO Port F Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D6</name>
              <description>GPIO Port G Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D7</name>
              <description>GPIO Port H Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D8</name>
              <description>GPIO Port J Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D9</name>
              <description>GPIO Port K Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D10</name>
              <description>GPIO Port L Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D11</name>
              <description>GPIO Port M Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D12</name>
              <description>GPIO Port N Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D13</name>
              <description>GPIO Port P Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCDMA</name>
          <description>Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCDMA_D0</name>
              <description>uDMA Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCHIB</name>
          <description>Hibernation Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000814</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCHIB_D0</name>
              <description>Hibernation Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUART_D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCSSI_D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCI2C</name>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCI2C_D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D4</name>
              <description>I2C Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D5</name>
              <description>I2C Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCAN</name>
          <description>Controller Area Network Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000834</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCCAN_D0</name>
              <description>CAN Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCADC</name>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCADC_D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCADC_D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCACMP_D0</name>
              <description>Analog Comparator Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCEEPROM_D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWTIMER</name>
          <description>Wide Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000085C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCWTIMER_D0</name>
              <description>Wide Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D1</name>
              <description>Wide Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D2</name>
              <description>Wide Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D3</name>
              <description>Wide Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D4</name>
              <description>Wide Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D5</name>
              <description>Wide Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRWD</name>
          <description>Watchdog Timer Peripheral Ready</description>
          <addressOffset>0x00000A00</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRWD_R0</name>
              <description>Watchdog Timer 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRWD_R1</name>
              <description>Watchdog Timer 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
